# 元组就是“一个不可变的列表”
# 1、作用：按照索引/位置存放多个值，只用于读不用于改
# 2、定义：() 内用逗号分隔开多个任意类型的元素
# t = (1, 1.3, 'aa')  # t=(0->值1的内存地址,1->值1.3的内存地址,2->值'aa'的内存地址)
# print(t, type(t))

# t = (10, )  # 如果元组中只有一个元素，必须加逗号
# print(t, type(t))

# t = (1, [2, 3])
# print(id(t[0]), id(t[1]))
# # t[0] = 2    # 报错
# t[1][0] = 5
# print(t)
# print(id(t[0]), id(t[1]))

# 3、类型转换
print(tuple('abcde'))
print(tuple([1, 2, 3]))
print(tuple({'k1': 111, 'k2': 222, 'k3': 333}))


# 4、使用
# 优先掌握的方法
# 4.1 索引
# 4.2 切片
# 4.3 长度
# 4.4 成员运算
# 4.5 循环

# 内置方法
# t = (1, 3, 'x', 3)
# res = t.count(3)
# print(res)
#
# res = t.index(3)
# print(res)


